ab25cq/comelang/sd/_/lpc176x/mmc_176x_ssp.c
	Timer2 = wt;
	do {
		d = xchg_spi(0xFF);

		/* This loop takes a time. Insert rot_rdq() here for multitask envilonment. */

	} while (d != 0xFF && Timer2);	/* Wait for card goes ready or timeout */

	return (d == 0xFF) ? 1 : 0;
}



/*-----------------------------------------------------------------------*/
/* Deselect card and release SPI                                         */
/*-----------------------------------------------------------------------*/

static void deselect (void)
{
	CS_HIGH();		/* CS = H */
	xchg_spi(0xFF);	/* Dummy clock (force DO hi-z for multiple slave SPI) */
}



/*-----------------------------------------------------------------------*/
/* Select card and wait for ready                                        */
/*-----------------------------------------------------------------------*/

static int select (void)	/* 1:OK, 0:Timeout */
{
	CS_LOW();		/* CS = L */
	xchg_spi(0xFF);	/* Dummy clock (force DO enabled) */

	if (wait_ready(500)) return 1;	/* Leading busy check: Wait for card ready */

	deselect();		/* Timeout */
	return 0;
}



/*-----------------------------------------------------------------------*/
/* Control SPI module (Platform dependent)                               */
/*-----------------------------------------------------------------------*/

static void power_on (void)	/* Enable SSP module and attach it to I/O pads */
{
	__set_PCONP(PCSSPx, 1);	/* Enable SSP module */
	__set_PCLKSEL(PCLKSSPx, PCLKDIV_SSP);	/* Select PCLK frequency for SSP */
	SSPxCPSR = 2;			/* CPSDVSR=2 */
	SSPxCR0 = 0x0007;		/* Set mode: SPI mode 0, 8-bit */
	SSPxCR1 = 0x2;			/* Enable SSP with Master */
	ATTACH_SSP();			/* Attach SSP module to I/O pads */
	CS_HIGH();				/* Set CS# high */

	for (Timer1 = 10; Timer1; ) ;	/* 10ms */
}


static void power_off (void)		/* Disable SPI function */
{
	select();				/* Wait for card ready */
	deselect();
}



/*-----------------------------------------------------------------------*/
/* Receive a data packet from the MMC                                    */
/*-----------------------------------------------------------------------*/

static int rcvr_datablock (	/* 1:OK, 0:Error */
	BYTE *buff,			/* Data buffer */
	UINT btr			/* Data block length (byte) */
)
{
	BYTE token;


	Timer1 = 200;
	do {							/* Wait for DataStart token in timeout of 200ms */
		token = xchg_spi(0xFF);

		/* This loop will take a time. Insert rot_rdq() here for multitask envilonment. */

	} while ((token == 0xFF) && Timer1);
	if(token != 0xFE) return 0;		/* Function fails if invalid DataStart token or timeout */

	rcvr_spi_multi(buff, btr);		/* Store trailing data to the buffer */
	xchg_spi(0xFF); xchg_spi(0xFF);	/* Discard CRC */

	return 1;						/* Function succeeded */
}



/*-----------------------------------------------------------------------*/
/* Send a data packet to the MMC                                         */
/*-----------------------------------------------------------------------*/

#if !FF_FS_READONLY
static int xmit_datablock (	/* 1:OK, 0:Failed */
	const BYTE *buff,	/* Ponter to 512 byte data to be sent */
	BYTE token			/* Token */
)
{
	BYTE resp;


	if (!wait_ready(500)) return 0;		/* Leading busy check: Wait for card ready to accept data block */

	xchg_spi(token);					/* Send token */
	if (token == 0xFD) return 1;		/* Do not send data if token is StopTran */

	xmit_spi_multi(buff, 512);			/* Data */
	xchg_spi(0xFF); xchg_spi(0xFF);		/* Dummy CRC */

	resp = xchg_spi(0xFF);				/* Receive data resp */

	return (resp & 0x1F) == 0x05 ? 1 : 0;	/* Data was accepted or not */

	/* Busy check is done at next transmission */
}
#endif

/*-----------------------------------------------------------------------*/
/* Send a command packet to the MMC                                      */
/*-----------------------------------------------------------------------*/

static BYTE send_cmd (		/* Return value: R1 resp (bit7==1:Failed to send) */
	BYTE cmd,		/* Command index */
	DWORD arg		/* Argument */
)
{
	BYTE n, res;


	if (cmd & 0x80) {	/* Send a CMD55 prior to ACMD<n> */
		cmd &= 0x7F;
		res = send_cmd(CMD55, 0);
		if (res > 1) return res;
	}

	/* Select the card and wait for ready except to stop multiple block read */
	if (cmd != CMD12) {
		deselect();
		if (!select()) return 0xFF;
	}

	/* Send command packet */
	xchg_spi(0x40 | cmd);				/* Start + command index */
	xchg_spi((BYTE)(arg >> 24));		/* Argument[31..24] */
	xchg_spi((BYTE)(arg >> 16));		/* Argument[23..16] */
	xchg_spi((BYTE)(arg >> 8));			/* Argument[15..8] */
	xchg_spi((BYTE)arg);				/* Argument[7..0] */
	n = 0x01;							/* Dummy CRC + Stop */
	if (cmd == CMD0) n = 0x95;			/* Valid CRC for CMD0(0) */
	if (cmd == CMD8) n = 0x87;			/* Valid CRC for CMD8(0x1AA) */
	xchg_spi(n);

	/* Receive command resp */
	if (cmd == CMD12) xchg_spi(0xFF);	/* Diacard following one byte when CMD12 */
	n = 10;								/* Wait for response (10 bytes max) */
	do
		res = xchg_spi(0xFF);
	while ((res & 0x80) && --n);

	return res;							/* Return received response */
}



/*-----------------------------------------------------------------------*/
/* Virtual Drive Feature                                                 */
/*-----------------------------------------------------------------------*/
#if VIRTUAL_DISK

static FIL VD_Fil;			/* Image file */
static BYTE VD_Stat = STA_NOINIT;	/* Disk status */
static WORD VD_SectorSize;	/* Sector size */
static DWORD VD_Sectors;	/* Size of virtural disk [sectors] (0:closed) */



static DSTATUS vd_init (void)
{
	if (VD_Sectors) VD_Stat &= ~STA_NOINIT;
	return VD_Stat;
}



static DSTATUS vd_stat (void)
{
	return VD_Stat;
}



static DRESULT vd_read (BYTE* buff, LBA_t sector, UINT count)
{
	DRESULT res = RES_ERROR;
	UINT br;


	if (!(VD_Stat & STA_NOINIT) &&
		sector + count <= VD_Sectors &&
		f_lseek(&VD_Fil, sector * VD_SectorSize) == FR_OK &&
		f_read(&VD_Fil, buff, count * VD_SectorSize, &br) == FR_OK) {
		res = RES_OK;
	}
	return res;
}


static DRESULT vd_ioctl (BYTE cmd, void* buff)
{
	DRESULT res = RES_ERROR;
#if FF_MAX_SS != FF_MIN_SS
	BYTE buf[2];
	WORD ss;
	UINT rb;
#endif

	switch (cmd) {
	case GET_SECTOR_COUNT :
		if (VD_Sectors) {
			*(DWORD*)buff = VD_Sectors;
			res = RES_OK;
		}
		break;
#if FF_MAX_SS != FF_MIN_SS
	case GET_SECTOR_SIZE :
		if (VD_Sectors) {
			*(WORD*)buff = VD_SectorSize;
			res = RES_OK;
		}
		break;
#endif
	case OPEN_VIRTUAL_DISK :
		VD_Sectors = 0;
		VD_Stat = STA_NOINIT | STA_PROTECT;
		if (f_open(&VD_Fil, (const TCHAR*)buff, FA_READ) == FR_OK) {
			VD_SectorSize = 512;
#if FF_MAX_SS != FF_MIN_SS
			if (f_lseek(&VD_Fil, 11) == FR_OK && f_read(&VD_Fil, buf, 2, &rb) == FR_OK) {	/* Check BPB_BytsPerSec */
				ss = buf[0] | buf[1] << 8;
				if (!(ss & (ss - 1)) && ss >= FF_MIN_SS && ss <= FF_MAX_SS) {
					VD_SectorSize = ss;
				}
			}
#endif
			VD_Sectors = f_size(&VD_Fil) / VD_SectorSize;
			res = RES_OK;
		}
		break;
	}
	return res;
}

#endif	/* #if VIRTUAL_DISK */



/*--------------------------------------------------------------------------

   Public Functions

---------------------------------------------------------------------------*/


/*-----------------------------------------------------------------------*/
/* Initialize disk drive                                                 */
/*-----------------------------------------------------------------------*/

DSTATUS disk_initialize (
	BYTE pdrv		/* Physical drive number (0:SD, 1:Image file in SD) */
)
{
	BYTE n, cmd, ty, ocr[4];

#if VIRTUAL_DISK
	if (pdrv == VIRTUAL_DISK) return vd_init();
#endif
	if (pdrv != 0) return STA_NOINIT;	/* Supports only drive 0 */

